Show / Hide Table of Contents
Namespace IdeaRS.OpenModel.Material
Classes
BoltAssembly
Bolt assembly
MatAnchorProperties
Anchor custom data
MatConcrete
Material concrete base class
MatConcreteACI
Material concrete ACI
MatConcreteAUS
Material concrete AUS
MatConcreteCAN
Material concrete CAN
MatConcreteEc2
Material concrete Ec2
MatConcreteHKG
Material concrete HKG
MatConcreteCHN
Material concrete CHN
MatConcreteIND
Material concrete IND
MatConcreteRUS
Material concrete CAN
MatConcreteSIA
Material concrete SIA
Material
Material base class
MaterialBoltGrade
Material bolt grade
MaterialBoltGradeHKG
Material bolt grade
MaterialStrength
Strength of material with specific thickness range
MaterialStrengthProperty
Class defines the strength of material acc. to materieal thickness
MatPrestressSteel
Material prestressing steel base class
MatPrestressSteelEc2
Material prestressing steel Ec2
MatPrestressSteelSIA
Material prestressing steel SIA
MatReinforcement
Material reinforcement base class
MatReinforcementACI
Material reinforcement ACI
MatReinforcementAUS
Material reinforcement AUS
MatReinforcementCAN
Material reinforcement CAN
MatReinforcementEc2
Material reinforcement Ec2
MatReinforcementHKG
Material reinforcement HKG
MatReinforcementCHN
Material reinforcement CHN
MatReinforcementIND
Material reinforcement IND
MatReinforcementRUS
Material reinforcement RUS
MatSteel
Material steel base class
MatSteelAISC
Material steel AISC
MatSteelAUS
Material steel AISC
MatSteelCISC
Material steel CISC
MatSteelEc2
Material steel Ec2
MatSteelHKG
Material steel HKG
MatSteelCHN
Material steel CHN
MatSteelIND
Material steel IND
MatSteelRUS
Material steel RUS
Enums
ConcAggregateType
Concrete aggreage type
ConcAggregateTypeSIA
Concrete aggreage type
ConcCementClass
Cement class
ConcCementClassSIA
Cement class
ConcDiagramType
Concrete stress-strain diagram
ConcFireDiagramType
Concrete stress-strain diagram for fire
CrackWidthRequirementsSIA
crack width requirement
PrestressSteelType
Type of prestress steel
PrestressSteelTypeSIA
Type of prestress steel
ProductionType
Production type
ReinfBarSurface
Reinforcement bar surface
ReinfClass
Reinforcement class type
ReinfDiagramType
Reinforcement stress-strain diagram
ReinfFabrication
Reinforcement fabrication
ReinfFireDiagramType
Stress-strain reeinforcemnt diagram for fire
ReinfType
Type of reinforcement
SteelDiagramType
Steel stress-strain diagram
SurfaceCharacteristicType
Surface characteristic
SurfaceCharacteristicTypeSIA
Surface characteristic
ThermalConductivityState
Type of curvature - thermal conductivity
ThermalExpansionState
Type of curvature - thermal expansion
ThermalSpecificHeatState
Type of curvature - thermal specific heat
ThermalStrainState
Type of curvature - thermal strain curvature
ThermalStressStrainState
Type of curvature - thermal stress-strain curvature